def day_update(day):
    return (day + 1) % 6

timetable = [
    [
        'Алгебра',
        'Алгебра',
        'Литература',
        'Физкультура',
        'Английский язык',
        'ОБЖ',
    ],
    [
        'Геометрия',
        'Геометрия',
        'Русский язык',
        'Обществознание',
        'Английский язык',
        'Биология',
        'Биология'
    ],
    [
        'Информатика и ИКТ',
        'Информатика и ИКТ',
        'География',
        'География',
        'Алгебра',
        'Алгебра',
    ],
    [
        'Физика',
        'Физика',
        'Литература',
        'Литература',
        'Английский язык',
        'Физкультура',
        'Алгебра'
    ],
    [
        'Химия',
        'Химия',
        'Русский язык',
        'Информатика и ИКТ',
        'Геометрия',
        'Геометрия',
    ],
    [
        'История',
        'История',
        'Русский язык',
        'Русский язык',
        'Физика',
        'Физика'
    ]
]
